<h4> Import libraries pandas and numpy <h4>

In [1]:
import pandas as pd
import matplotlib as mlt

In [2]:
import numpy as np

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
s = pd.Series([1,3,5,6,8])

In [6]:
s

0    1
1    3
2    5
3    6
4    8
dtype: int64

<h4> Built in Functions in Python<h4>

In [7]:
dates= pd.date_range("20240101",periods = 6)
dates

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df  = pd.DataFrame(np.random.rand(6,4) , index=dates , columns=list("ABCD") )
df

                   A         B         C         D
2024-01-01  0.812436  0.798039  0.401927  0.193006
2024-01-02  0.012347  0.874310  0.146710  0.667366
2024-01-03  0.345376  0.260731  0.813421  0.496053
2024-01-04  0.375189  0.512041  0.028479  0.436998
2024-01-05  0.622378  0.989430  0.931609  0.197204
2024-01-06  0.336661  0.256797  0.529648  0.725554

In [9]:
df2 = pd.DataFrame(
    {
      "A" : 1.0,
      "B" : pd.Timestamp("20130102"),
      "C": pd.Series(1, index = list(range(4)), dtype="float32"),
      


    }
)

In [10]:
df2

     A          B    C
0  1.0 2013-01-02  1.0
1  1.0 2013-01-02  1.0
2  1.0 2013-01-02  1.0
3  1.0 2013-01-02  1.0

In [11]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
dtype: object

<h4> Builtin Functions in Python for datasets<h4>

In [12]:
df.head()  # data

                   A         B         C         D
2024-01-01  0.812436  0.798039  0.401927  0.193006
2024-01-02  0.012347  0.874310  0.146710  0.667366
2024-01-03  0.345376  0.260731  0.813421  0.496053
2024-01-04  0.375189  0.512041  0.028479  0.436998
2024-01-05  0.622378  0.989430  0.931609  0.197204

In [13]:
df.info()  # provides summary of data

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2024-01-01 to 2024-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [14]:
df.tail(2)

                   A         B         C         D
2024-01-05  0.622378  0.989430  0.931609  0.197204
2024-01-06  0.336661  0.256797  0.529648  0.725554

In [15]:
df2.index

Index([0, 1, 2, 3], dtype='int64')

In [16]:
df.columns #

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.describe() #represent cotiles of data

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.417398  0.615225  0.475299  0.452697
std    0.274090  0.317918  0.357352  0.225998
min    0.012347  0.256797  0.028479  0.193006
25%    0.338840  0.323558  0.210514  0.257152
50%    0.360283  0.655040  0.465787  0.466526
75%    0.560581  0.855242  0.742477  0.624538
max    0.812436  0.989430  0.931609  0.725554

In [18]:
df.T  #transpose rows and columns

   2024-01-01  2024-01-02  2024-01-03  2024-01-04  2024-01-05  2024-01-06
A    0.812436    0.012347    0.345376    0.375189    0.622378    0.336661
B    0.798039    0.874310    0.260731    0.512041    0.989430    0.256797
C    0.401927    0.146710    0.813421    0.028479    0.931609    0.529648
D    0.193006    0.667366    0.496053    0.436998    0.197204    0.725554

In [19]:
df.sort_index(axis=1, ascending = False) # for columns deletion

                   D         C         B         A
2024-01-01  0.193006  0.401927  0.798039  0.812436
2024-01-02  0.667366  0.146710  0.874310  0.012347
2024-01-03  0.496053  0.813421  0.260731  0.345376
2024-01-04  0.436998  0.028479  0.512041  0.375189
2024-01-05  0.197204  0.931609  0.989430  0.622378
2024-01-06  0.725554  0.529648  0.256797  0.336661

In [20]:
df.sort_values(by = "B")

                   A         B         C         D
2024-01-06  0.336661  0.256797  0.529648  0.725554
2024-01-03  0.345376  0.260731  0.813421  0.496053
2024-01-04  0.375189  0.512041  0.028479  0.436998
2024-01-01  0.812436  0.798039  0.401927  0.193006
2024-01-02  0.012347  0.874310  0.146710  0.667366
2024-01-05  0.622378  0.989430  0.931609  0.197204

In [21]:
df["A"] # selection of columns

2024-01-01    0.812436
2024-01-02    0.012347
2024-01-03    0.345376
2024-01-04    0.375189
2024-01-05    0.622378
2024-01-06    0.336661
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]

                   A         B         C         D
2024-01-01  0.812436  0.798039  0.401927  0.193006
2024-01-02  0.012347  0.874310  0.146710  0.667366
2024-01-03  0.345376  0.260731  0.813421  0.496053

In [23]:
df["20240102":"20240104"]

                   A         B         C         D
2024-01-02  0.012347  0.874310  0.146710  0.667366
2024-01-03  0.345376  0.260731  0.813421  0.496053
2024-01-04  0.375189  0.512041  0.028479  0.436998

In [24]:
df.loc[dates[1]] # to find location in datasets

A    0.012347
B    0.874310
C    0.146710
D    0.667366
Name: 2024-01-02 00:00:00, dtype: float64

In [25]:
df.loc[:, ["A","B"]] #select index

                   A         B
2024-01-01  0.812436  0.798039
2024-01-02  0.012347  0.874310
2024-01-03  0.345376  0.260731
2024-01-04  0.375189  0.512041
2024-01-05  0.622378  0.989430
2024-01-06  0.336661  0.256797

In [26]:
df.iloc[3]   #selection of location by position

A    0.375189
B    0.512041
C    0.028479
D    0.436998
Name: 2024-01-04 00:00:00, dtype: float64

In [27]:
df.iloc[3:5 , 0:2]   # form one column to another column

                   A         B
2024-01-04  0.375189  0.512041
2024-01-05  0.622378  0.989430

In [28]:
df2 = df.copy() # for copying datasets

In [29]:
df2

                   A         B         C         D
2024-01-01  0.812436  0.798039  0.401927  0.193006
2024-01-02  0.012347  0.874310  0.146710  0.667366
2024-01-03  0.345376  0.260731  0.813421  0.496053
2024-01-04  0.375189  0.512041  0.028479  0.436998
2024-01-05  0.622378  0.989430  0.931609  0.197204
2024-01-06  0.336661  0.256797  0.529648  0.725554

In [30]:
df2["E"] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2024-01-01  0.812436  0.798039  0.401927  0.193006    one
2024-01-02  0.012347  0.874310  0.146710  0.667366    one
2024-01-03  0.345376  0.260731  0.813421  0.496053    two
2024-01-04  0.375189  0.512041  0.028479  0.436998  three
2024-01-05  0.622378  0.989430  0.931609  0.197204   four
2024-01-06  0.336661  0.256797  0.529648  0.725554  three

<h4> Missing Data <h4>

In [31]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C         D    E
2024-01-01  0.812436  0.798039  0.401927  0.193006  1.0
2024-01-02  0.012347  0.874310  0.146710  0.667366  1.0
2024-01-03  0.345376  0.260731  0.813421  0.496053  NaN
2024-01-04  0.375189  0.512041  0.028479  0.436998  NaN

In [32]:
df1.dropna(how="any")

                   A         B         C         D    E
2024-01-01  0.812436  0.798039  0.401927  0.193006  1.0
2024-01-02  0.012347  0.874310  0.146710  0.667366  1.0

In [33]:
df1.fillna(value=5)

                   A         B         C         D    E
2024-01-01  0.812436  0.798039  0.401927  0.193006  1.0
2024-01-02  0.012347  0.874310  0.146710  0.667366  1.0
2024-01-03  0.345376  0.260731  0.813421  0.496053  5.0
2024-01-04  0.375189  0.512041  0.028479  0.436998  5.0

In [34]:
pd.isna(df1)

                A      B      C      D      E
2024-01-01  False  False  False  False  False
2024-01-02  False  False  False  False  False
2024-01-03  False  False  False  False   True
2024-01-04  False  False  False  False   True

In [35]:
#f.isnull().sum()*100/len(df)

In [36]:
#df.isnull().sum()

<h4>Stats Built in Functions<h4>

In [37]:
df.mean()

A    0.417398
B    0.615225
C    0.475299
D    0.452697
dtype: float64

In [38]:
df.mean(axis=1)

2024-01-01    0.551352
2024-01-02    0.425183
2024-01-03    0.478895
2024-01-04    0.338177
2024-01-05    0.685155
2024-01-06    0.462165
Freq: D, dtype: float64

In [39]:
result = np.mod(s, 3)
result

0    1
1    0
2    2
3    0
4    2
dtype: int64

In [40]:
median = np.median(s)
median

5.0

<h4> User Defined Functions in Python <h4>

In [41]:

def greet(name):
    print("Hello, " + name + "!")

In [42]:
greet("Ali")

Hello, Ali!

In [43]:
def sum_all(*args):
  
    return sum(args)

# Using the functionprint(sum_all(1, 2, 3, 4))  
print(sum_all(10, 20))      

def display_info(**kwargs):
  
    for key, value in kwargs.items():
        print(f"{key}: {value}")

display_info(name="Arsal", age=34, city="islamabad")

30
name: Arsal
age: 34
city: islamabad

<h4> Value Counts <h4>

In [44]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    5
1    3
2    5
3    1
4    0
5    1
6    3
7    5
8    4
9    3
dtype: int32

<h4> String Methods <h4>

In [45]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [46]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [47]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

<h4> Merge <h4>

In [48]:
d1 = pd.DataFrame({
    'key': ['A', 'B', 'C', 'D'],
    'value1': [1, 2, 3, 4]
})

d2 = pd.DataFrame({
    'key': ['A', 'B', 'C', 'E'],
    'value2': [5, 6, 7, 8]
})

merged_df = pd.merge(d1, d2, on='key')

print(merged_df)

  key  value1  value2
0   A       1       5
1   B       2       6
2   C       3       7

<h4> Grouping <h4>

In [49]:
data = {
    'Category': ['A', 'A', 'B', 'B', 'C', 'C', 'C'],
    'Value': [10, 15, 10, 20, 10, 15, 20]
}

df = pd.DataFrame(data)

grouped_df = df.groupby('Category').sum()

print(grouped_df)

          Value
Category
A            25
B            30
C            45

In [50]:
data = {
    'Category': ['A', 'A', 'B', 'B', 'C', 'C', 'C'],
    'Subcategory': ['X', 'Y', 'X', 'Y', 'X', 'Y', 'X'],
    'Value': [10, 15, 10, 20, 10, 15, 20]
}

df = pd.DataFrame(data)

grouped_df = df.groupby(['Category', 'Subcategory']).sum()

print(grouped_df)

                      Value
Category Subcategory
A        X               10
         Y               15
B        X               10
         Y               20
C        X               30
         Y               15

<h4> Reshaping <h4>

In [51]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]
# Create a sample DataFrame
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}

df = pd.DataFrame(data, index=['one', 'two', 'three'])

print("Original DataFrame:")
print(df)

# Stack the DataFrame
stacked_df = df.stack()

print("\nStacked DataFrame:")
print(stacked_df)

Original DataFrame:
       A  B  C
one    1  4  7
two    2  5  8
three  3  6  9

Stacked DataFrame:
one    A    1
       B    4
       C    7
two    A    2
       B    5
       C    8
three  A    3
       B    6
       C    9
dtype: int64

<h4> Pivot Table <h4>

In [52]:
data = {
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02', '2024-01-03', '2024-01-03'],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York', 'Los Angeles'],
    'Sales': [200, 150, 220, 180, 250, 210]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

# Create a pivot table
pivot_table = pd.pivot_table(df, values='Sales', index='Date', columns='City', aggfunc='sum')

print("\nPivot Table:")
print(pivot_table)

Original DataFrame:
         Date         City  Sales
0  2024-01-01     New York    200
1  2024-01-01  Los Angeles    150
2  2024-01-02     New York    220
3  2024-01-02  Los Angeles    180
4  2024-01-03     New York    250
5  2024-01-03  Los Angeles    210

Pivot Table:
City        Los Angeles  New York
Date
2024-01-01          150       200
2024-01-02          180       220
2024-01-03          210       250

<h4> Categoricals <h4>

In [53]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [54]:
new_categories = ["very good", "good", "very bad"]

In [55]:
df["grade"] = df["grade"].cat.rename_categories(new_categories)

In [56]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [57]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [58]:
df.groupby("grade", observed=False).size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

<h4> Read dataset <h4>

In [59]:
df = pd.read_excel('tash.xlsx')

In [60]:
print(df)

    Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5  \
0          NaN         NaN         NaN         NaN         NaN         NaN
1      0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
2      0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
3      0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
4      0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
5      0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
6      0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
7      0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
8      0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
9      0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
10     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
11     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
12     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
13     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
14     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
15     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
16     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
17     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
18     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
19     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
20     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
21     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
22     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
23     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
24     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
25     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
26     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478
27     0.23478     0.23478     0.23478     0.23478     0.23478     0.23478

    Unnamed: 6  Unnamed: 7  Unnamed: 8  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0          NaN         NaN         NaN         NaN          NaN          NaN
1      0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
2      0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
3      0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
4      0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
5      0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
6      0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
7      0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
8      0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
9      0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
10     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
11     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
12     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
13     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
14     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
15     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
16     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
17     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
18     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
19     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
20     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
21     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
22     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
23     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
24     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
25     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
26     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478
27     0.23478     0.23478     0.23478     0.23478      0.23478      0.23478

    Unnamed: 12
0           NaN
1       0.23478
2       0.23478
3       0.23478
4       0.23478
5       0.23478
6       0.23478
7       0.23478
8       0.23478
9       0.23478
10      0.23478
11      0.23478
12      0.23478
13      0.23478
14      0.23478
15      0.23478
16      0.23478
17      0.23478
18      0.23478
19      0.23478
20      0.23478
21      0.23478
22      0.23478
23      0.23478
24      0.23478
25      0.23478
26      0.23478
27      0.23478